hdh3296/pic18f45k80_rs232/src/cpu18f4480.c


#include    <pic18.h>
 
//#include        "cpu18f4480.h"
#include        "crt_45k80.h"



#ifdef	CPU65K80
    __CONFIG(1, (RETEN_OFF & INTOSCSEL_LOW & SOSCSEL_DIG & XINST_OFF & FOSC_HS1 & PLLCFG_ON & FCMEN_OFF & IESO_OFF  & 0xffff));                   
    __CONFIG(2, (PWRTEN_ON & BOREN_SBORDIS & BOREN_ON & BORV_1 & BORPWR_LOW  & WDTEN_NOSLP & WDTPS_64 & 0xffff));         
    __CONFIG(3, (CANMX_PORTB & T0CKMX_PORTB & T3CKMX_PORTG & MSSPMSK_MSK7 & MCLRE_ON   & 0xffff));                         // PORTB digital on RESET
    __CONFIG(4, (STVREN_ON & BBSIZ_BB2K & 0xffff));    
                                                                                // DEBUG disabled,
                                                                                // XINST disabled
                                                                                // LVP disabled
                                                                                // STVREN enabled
    __CONFIG(5, (CP0_OFF& CP1_OFF & CP2_OFF & CP3_OFF & CPB_OFF & CPD_OFF & 0xffff));                                          // code unprotect
    __CONFIG(6, (WRT0_OFF & WRT1_OFF & WRT2_OFF & WRT3_OFF & WRTC_OFF & WRTB_OFF & WRTD_OFF & 0xffff));                                              // code unprotect
    __CONFIG(7, (EBTR0_OFF & EBTR1_OFF & EBTR2_OFF & EBTR3_OFF & EBTRB_OFF & 0xffff));                                               // code unprotect


#elif	CPU45K80
    __CONFIG(1, (RETEN_OFF & INTOSCSEL_LOW & SOSCSEL_DIG & XINST_OFF & FOSC_HS1 & PLLCFG_ON & FCMEN_OFF & IESO_OFF  & 0xffff));                   
    __CONFIG(2, (PWRTEN_ON & BOREN_SBORDIS & BOREN_ON & BORV_1 & BORPWR_LOW  & WDTEN_NOSLP & WDTPS_64 & 0xffff));         
    __CONFIG(3, (CANMX_PORTB & MSSPMSK_MSK7 & MCLRE_ON   & 0xffff));                         // PORTB digital on RESET
    __CONFIG(4, (STVREN_ON & BBSIZ_BB2K & 0xffff));    
                                                                                // DEBUG disabled,
                                                                                // XINST disabled
                                                                                // LVP disabled
                                                                                // STVREN enabled
    __CONFIG(5, (CP0_OFF& CP1_OFF & CP2_OFF & CP3_OFF & CPB_OFF & CPD_OFF & 0xffff));                                          // code unprotect
    __CONFIG(6, (WRT0_OFF & WRT1_OFF & WRT2_OFF & WRT3_OFF & WRTC_OFF & WRTB_OFF & WRTD_OFF & 0xffff));                                              // code unprotect
    __CONFIG(7, (EBTR0_OFF & EBTR1_OFF & EBTR2_OFF & EBTR3_OFF & EBTRB_OFF & 0xffff));                                               // code unprotect

#else
    __CONFIG(1, (HSPLL  & FCMDIS & IESODIS & 0xcfff));                          // HSPLL oscillator
    __CONFIG(2, (PWRTEN & BOREN  & BORV28 & WDTEN & WDTPS64 & 0x1f1f));         // PWRTEN disabled, BOR enabled @ 2.0V, HW WD disabled, 1:128 prescaler
    __CONFIG(3, (PBADDIS & LPT1DIS & MCLREN & 0x86ff));                         // PORTB digital on RESET
    __CONFIG(4, (STVREN & LVPDIS & BBSIZ1K & XINSTDIS & DEBUGDIS & 0xffd5));    
                                                                                // DEBUG disabled,
                                                                                // XINST disabled
                                                                                // LVP disabled
                                                                                // STVREN enabled
    __CONFIG(5, (UNPROTECT & 0xc00f));                                          // code unprotect
    __CONFIG(6, (WRTEN & 0xe00f));                                              // code unprotect
    __CONFIG(7, (TREN & 0x400f));                                               // code unprotect

#endif


void  Timer0Init(void)
{
  TMR0IE=1;
  TMR0IF=0;

  TMR0ON=1;	    // TMR0 on/off
  T08BIT=0;	    // 8/16 bit select    ..(16bit)
  T0CS=0;	    // TMR0 Source Select ..(internal clock)
  T0SE=0;	    // TMR0 Source Edge Select
  PSA=0;	    // Prescaler Assignment ..(enable)
  T0PS2=0;	    // Prescaler..............(1:2)
  T0PS1=1;
  T0PS0=0;
 
  TMR0L=MSEC_L;
  TMR0H=MSEC_H;
} 




#if defined(CPU65K80)  || defined(CPU45K80)

void  Initial(void)
{

///////////////////////////////////////////////
// INTCON Register
	GIE=0;        // global interrupt enable
  	PEIE=1;	    // peripheral interrupt enable
  	TMR0IE=1;	    // TMR0 overflow interrupt enable
  	INT0IE=0;	    // external interrupt 0 enable
  	RBIE=0;	    // RB port change interrupt enable
  	TMR0IF=0;	    // TMR0 overflow interrupt flag
  	INT0IF=0;	    // external interrupt 0 flag
  	RBIF=0;	    // RB port change interrupt flag


///////////////////////////////////////////////
// INTCON2 Register
  	RBPU=1;	    // port B pull-up enable
  	INTEDG0=0;	// external interrupt 0 edge select
  	INTEDG1=0;	// external interrupt 1 edge select
  	INTEDG2=0;	// external interrupt 2 edge select
  	TMR0IP=1;	    // TMR0 overflow interrupt priority
  	RBIP=0;	    // RB port change interrupt priority

///////////////////////////////////////////////
// INTCON3 Register
	INTCON3=0;
/*
  INT2IP=0;	    // external interrupt 2 priority
  INT1IP=0;	    // external interrupt 1 priority
  INT2IE=0;	    // external interrupt 2 enable
  INT1IE=0;	    // external interrupt 1 enable
  INT2IF=0;	    // external interrupt 2 flag
  INT1IF=0;	    // external interrupt 1 flag
*/


///////////////////////////////////////////////
// T0CON Register
  	TMR0ON=1;	    // TMR0 on/off
  	T08BIT=0;	    // 8/16 bit select    ..(16bit)
  	T0CS=0;	    // TMR0 Source Select ..(internal clock)
  	T0SE=0;	    // TMR0 Source Edge Select
  	PSA=0;	    // Prescaler Assignment ..(enable)
  	T0PS2=0;	    // Prescaler..............(1:2)
  	T0PS1=0;
  	T0PS0=1;

// OSCCON Register
  	SCS0=0;	    // system clock switch bit
  	SCS1=0;	    // system clock switch bit


// LVDCON Register
  	IRVST=0;	    // input reference voltage stable status..(read only)
  	HLVDEN=1;	    // low voltage detect enable..............(enable)
  	HLVDL3=1;	    // low voltage detection limits...........(4.16V - 4.5V)
  	HLVDL2=1;
  	HLVDL1=0;
  	HLVDL0=1;

