hdh3296/pic18f45k80_rs232/src/cpu18f4480.c
}


#else

void  Initial(void)
{
///////////////////////////////////////////////
// INTCON Register
	GIE=0;        // global interrupt enable
  	PEIE=1;	    // peripheral interrupt enable
  	TMR0IE=1;	    // TMR0 overflow interrupt enable
  	INT0IE=0;	    // external interrupt 0 enable
  	RBIE=0;	    // RB port change interrupt enable
  	TMR0IF=0;	    // TMR0 overflow interrupt flag
  	INT0IF=0;	    // external interrupt 0 flag
  	RBIF=0;	    // RB port change interrupt flag


///////////////////////////////////////////////
// INTCON2 Register
  	RBPU=1;	    // port B pull-up enable
  	INTEDG0=0;	// external interrupt 0 edge select
  	INTEDG1=0;	// external interrupt 1 edge select
  	INTEDG2=0;	// external interrupt 2 edge select
  	TMR0IP=1;	    // TMR0 overflow interrupt priority
  	RBIP=0;	    // RB port change interrupt priority

///////////////////////////////////////////////
// INTCON3 Register
	INTCON3=0;
/*
  INT2IP=0;	    // external interrupt 2 priority
  INT1IP=0;	    // external interrupt 1 priority
  INT2IE=0;	    // external interrupt 2 enable
  INT1IE=0;	    // external interrupt 1 enable
  INT2IF=0;	    // external interrupt 2 flag
  INT1IF=0;	    // external interrupt 1 flag
*/


///////////////////////////////////////////////
// T0CON Register
  	TMR0ON=1;	    // TMR0 on/off
  	T08BIT=0;	    // 8/16 bit select    ..(16bit)
  	T0CS=0;	    // TMR0 Source Select ..(internal clock)
  	T0SE=0;	    // TMR0 Source Edge Select
  	PSA=0;	    // Prescaler Assignment ..(enable)
  	T0PS2=0;	    // Prescaler..............(1:2)
  	T0PS1=0;
  	T0PS0=1;

// OSCCON Register
  	SCS0=0;	    // system clock switch bit
  	SCS1=0;	    // system clock switch bit



// LVDCON Register
  	IRVST=0;	    // input reference voltage stable status..(read only)
  	HLVDEN=1;	    // low voltage detect enable..............(enable)
  	HLVDL3=1;	    // low voltage detection limits...........(4.16V - 4.5V)
  	HLVDL2=1;
  	HLVDL1=0;
  	HLVDL0=1;

// WDTCON Register
  	SWDTEN=0;	    // software watchdog timer enable.......(disable)

// RCON Register
  	IPEN=0;	    // interrupt priority enable............(disable)?????
  	RI=0;	        // RESET instruction status
  	TO=0;	        // watchdog timeout flag
  	PD=0;	        // power-down detection
  	POR=0;	    // power-on reset status
  	BOR=0;	    // brown-our reset status

// T1CON Register
  	RD1=1;	// 16 Bit Read/Write Enable
  //T1RD16=1;	// 16 Bit Read/Write Enable
  	T1CKPS1=1;	// Prescaler ........(1/8)
  	T1CKPS0=1;
  	T1OSCEN=0;	// Oscillator Enable....(disable)
  	T1SYNC=0;	    // Sync Selct
  	TMR1CS=0;	    // TMR Clock Source Select..(internal clock)
  	TMR1ON=1;	    // TMR on/off...............( tmr run)

/*
static          near bit	T2CKPS0		@ ((unsigned)&T2CON*8)+0;
static          near bit	T2CKPS1		@ ((unsigned)&T2CON*8)+1;
static          near bit	TMR2ON		@ ((unsigned)&T2CON*8)+2;
static          near bit	T2OUTPS0	@ ((unsigned)&T2CON*8)+3;
static          near bit	T2OUTPS1	@ ((unsigned)&T2CON*8)+4;
static          near bit	T2OUTPS2	@ ((unsigned)&T2CON*8)+5;
static          near bit	T2OUTPS3	@ ((unsigned)&T2CON*8)+6;
*/

// T2CON Register
	T2CON=0;
/*
  T2OUTPS3=0;	// Postscale
  T2OUTPS2=0;
  T2OUTPS1=0;
  T2OUTPS0=0;
  TMR2ON=0;	    // TMR2 On/Off............(off)
  T2CKPS1=0;	// Prescale
  T2CKPS0=0;
*/

// SSPSTAT Register..........(not use)
	SSPSTAT=0;
/*
  SMP=0;	    // Sample Bit
  CKE=0;	    // SPI Clk Edge Select
  DA=0;	        // Data/Address Bit
  STOP=0;	    // STOP Bit detected
  START=0;	    // START Bit detected
  RW=0;	        // Read/Write bit Information
  UA=0;	        // Update Adress
  BF=0;	        // Buffer Full Status bit
*/

// SSPCON1 Register..........(not use)
  	WCOL=0;	    // write collision detect
  	SSPOV=0;	    // recieve overflow indicator
  	SSPEN=0;	    // SSP enable
  	CKP=0;	    // clock polarity select
  	SSPM3=0;	    // SSP mode select 
  	SSPM2=1;
  	SSPM1=0;
  	SSPM0=1;
	

// SSPCON2 Register.......(not use)

	SSPCON2=0;
/*
  GCEN=0;	    // general call enable
//  ACKSTA=0;	    // acknowledge status bit
  ACKDT=0;	    // acknowledge data bit
  ACKEN=0;	    // acknowledge sequence enable
  RCEN=0;	    // recieve enable bit
  PEN=0;	    // STOP condition enable
  RSEN=0;	    // repeated START enable
  SEN=0;	    // START condition enable
*/

// ADCON0 Register...(not use)  
  	CHS3=1;	    // channel select
  	CHS2=1;	    // channel select
  	CHS1=1;
  	CHS0=1;
  	GODONE=0;	    // AD conversion status
  	ADON=0;	    // AD on status



// ADCON1 Register....(not use)
  	PCFG3=1;	    // AD port config bits....(all digital)
  	PCFG2=1;
  	PCFG1=1;
  	PCFG0=1;
  	VCFG0=0; 
  	VCFG1=0; 

// ADCON2 Register....(not use)
	ADCON2=0;
/*
  ADFM=0;	    // AD result format
  ACQT2=0;
  ACQT1=0;
  ACQT0=0;
  ADCS2=0;	    // AD conv. clock select bits
  ADCS1=0;	    // AD conv. clock select bits
  ADCS0=0;
*/


// CCP1CON Register......(not use)
  	DC1B1=0;	    // Duty Cycle Bits 1 & 0
  	DC1B0=0;
  	CCP1M3=0;	    // Mode Select Bits...(can messag receive)
  	CCP1M2=0;
  	CCP1M1=1;
  	CCP1M0=1;

// ECCP1CON Register.......(not use)     
  	EPWM1M1=0;	// PWM output config bits
  	EPWM1M0=0;
  	EDC1B1=0;	// PWM duty cycle LSBs
  	EDC1B0=0;
  	ECCP1M3=0;	// EEPC1 mode select bits
  	ECCP1M2=0;
  	ECCP1M1=0;
  	ECCP1M0=1;


// ECCP1DEL Register.....(not use)
	ECCP1DEL=0;
/*
  PRSEN=0;	// PWM DELAY
  PDC6=0;
  PDC5=0;
  PDC4=0;
  PDC3=0;
  PDC2=0;
  PDC1=0;
  PDC0=0;
*/


/*
static          near bit	PSSBD0		@ ((unsigned)&ECCP1AS*8)+0;
static          near bit	PSSBD1		@ ((unsigned)&ECCP1AS*8)+1;
static          near bit	PSSAC0		@ ((unsigned)&ECCP1AS*8)+2;
static          near bit	PSSAC1		@ ((unsigned)&ECCP1AS*8)+3;
static          near bit	ECCPAS0		@ ((unsigned)&ECCP1AS*8)+4;
static          near bit	ECCPAS1		@ ((unsigned)&ECCP1AS*8)+5;
static          near bit	ECCPAS2		@ ((unsigned)&ECCP1AS*8)+6;
static volatile near bit	ECCPASE		@ ((unsigned)&ECCP1AS*8)+7;
*/

// ECCPAS Register.....(not use)
  	ECCPASE=0;	// ECCP auto-shutdown event status
  	ECCPAS2=0;	// EECP auto-shutdown bits
  	ECCPAS1=0;
  	ECCPAS0=0;
  	PSSAC1=1;	    // pin A & C auto-shutdown control
  	PSSAC0=0;
  	PSSBD1=1;	    // pin B & D auto-shutdown control
  	PSSBD0=0;


// CVRCON Register...............(not use)
	CVRCON=0;
/*
  CVREN=0;	    // comparator voltage reference enable
  CVROE=0;	    // comparator VREF output enable
  CVRR=0;	    // comparator VREF range select
  CVRSS=0;	    // comparator VREF source select
  CVR3=0;	    // comparator VREF value selection
  CVR2=0;
  CVR1=0;
  CVR0=0;
*/


// CMCON Comparator module register.....(not use)
  	C2OUT=0;	   // comparator 2 output
  	C1OUT=0;	   // comparator 1 output
  	C2INV=0;	   // select to invert comp2 output
  	C1INV=0;	   // select to invert comp1 output
  	CIS=0;	   // comp input switch bit
  	CM2=1;	   // comp mode select bits
  	CM1=1;
  	CM0=1;


// T3CON Register.......(not use) 
	T3CON=0;
/*
  T3RD16=0;	    // 16-Bit Read/Write select
  T3ECCP1=0;	// TMR3 & TMR1 CCPx Enable
  T3CKPS1=0;	// Prescaler
  T3CKPS0=0;
  T3CCP1=0;	    // TMR3 & TMR1 CCPx Enable
  T3SYNC=0;	    // Sync Select
  TMR3CS=0;	    // TMR3 source Select
  TMR3ON=0;	    // TMR3 on/off
*/




// TXSTA Register
	TXSTA=0;
/*
  CSRC=0;      // CLK source select
  TX9=0	;	   // 8/9 bit TX data select
  TXEN=1;	   // transmit enable bit
  SYNC=0;	   // USART mode select
  BRGH=1;	   // high baud rate select
  TRMT=1;	   // TX shift reg. status bit
  TX9D=1;	   // 9th Bit of TX data
*/



// RCSTA Register  
	RCSTA=0;
/*
  SPEN=0;	  // serial port enable...(disable)
  RX9=0;	  // 8/9 bit data reception
  SREN=0;	  // single recieve enable
  CREN=0;	  // continuous recieve enable
  ADDEN=0;	  // address detect enable
  FERR=0;	  // framing error
  OERR=0;	  // overrun error
  RX9D=0;	  // 9th Bit of RX data
*/


// EECON1 Register
  	EEPGD=0;	  // FLASH/EEPROM select
  	CFGS=0;	  // access config regs./access FLASH-EEPROM

// alternate definition
  	CFGS=0; 	  //Config./Calibration Select
  	FREE=0;	  // FLASH row erase enable
  	WRERR=0;	  // write error flag
  	WREN=0;	  // write enable
  	WR=0;	      // write control
  	RD=0;	      // read control

